Cases/1.0mps/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

// 🚨 벽 함수 자살 방지용 극소량의 양수 주입
internalField   uniform 1e-10;

boundaryField
{
    inlet  { type calculated; value $internalField; }
    outlet { type calculated; value $internalField; }
    "(wall|slag)" 
    { 
        type            compressible::alphatWallFunction; 
        Prw             0.85; 
        value           $internalField; 
    }
}