Cases/1.0mps/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  2312
\*---------------------------------------------------------------------------*/
FoamFile { version 2.0; format ascii; class volScalarField; object k; }
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0.01; // 초기 유동 강도에 따라 조절

boundaryField
{
    inlet  { type fixedValue; value $internalField; }
    outlet { type zeroGradient; }
    "(wall|slag)" { type kLowReWallFunction; value $internalField; }
}