Cases/1.0mps/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  2312
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

// 🚨 수치해석적 자살 방지: 완벽한 0 대신 극소량의 양수 주입!
internalField   uniform 1e-10;

boundaryField
{
    inlet
    {
        type            calculated;
        value           $internalField;
    }
    outlet
    {
        type            calculated;
        value           $internalField;
    }
    "(wall|slag)"
    {
        type            nutkWallFunction;
        value           $internalField; // 이제 1e-10이 들어가서 분모가 터지지 않음!
    }
}
// ************************************************************************* //