Cases/1.0mps/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
=========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  2312
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325; // 0 대신 1기압(대기압)을 기본값으로 줌

boundaryField
{
    inlet  { type fixedFluxPressure; value uniform 101325; }
    outlet { type prghTotalPressure; p0 uniform 101325; rho rho; g g; value uniform 101325; }
    wall   { type fixedFluxPressure; value uniform 101325; }
}
// ************************************************************************* //