Cases/1.0mps/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    outlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1868;
        startFace       1281760;
    }
    inlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1208;
        startFace       1283628;
    }
    wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          127352;
        startFace       1284836;
    }
)

// ************************************************************************* //
