Cases/1.0mps/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  2312
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (water gas);

water
{
    transportModel  Newtonian;
    nu              1e-06;
    rho             1000;
}

gas
{
    transportModel  Newtonian;
    nu              1.5e-05;
    rho             1.2;
}

sigma           0.072;

Pr              0.7;  
Prt             0.85; 