Cases/1.0mps/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  2312
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

vertices
(
    (-30 -30  -1) // 0
    ( 30 -30  -1) // 1 
    ( 30  30  -1) // 2 
    (-30  30  -1) // 3
    (-30 -30 110) // 4
    ( 30 -30 110) // 5
    ( 30  30 110) // 6
    (-30  30 110) // 7
);

blocks
(
    // (x y z) 격자 수를 사이즈 비율에 맞춤 (약 1:1:2 비율)
    hex (0 1 2 3 4 5 6 7) (30 30 55) simpleGrading (1 1 1)
);

edges ();

boundary
(
    // snappyHexMesh를 쓸 거라면 바깥쪽은 보통 'defaultFaces'로 두거나 
    // 아래처럼 간단히 정해줍니다.
    allBoundary
    {
        type patch;
        faces
        (
            (3 2 1 0) // bottom
            (4 5 6 7) // top
            (0 1 5 4) // front
            (1 2 6 5) // right
            (2 3 7 6) // back
            (3 0 4 7) // left
        );
    }
);