Cases/1.0mps/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  2312
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     CIPCFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         10.0;

deltaT          1e-05;

writeControl    runTime;

writeInterval   0.05;

writeFormat     ascii;

writePrecision  6;

compression     off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           0.2;
maxAlphaCo      0.2;
maxDeltaT       1;

functions
{
    // 1. 벽면 최대 압력 트래킹
    wallPressureMax
    {
        type            fieldMinMax;
        libs            (fieldFunctionObjects);
        display         yes;
        location        yes;
        fields          (p_rgh); // 솔버가 p를 쓰면 p로 수정
    }

    // 2. 출구 물 질량 유량 (alpha.water 가중치 적용)
    outletWaterMass
    {
        type            faceSource;
        libs            (fieldFunctionObjects);
        enabled         true;
        writeControl    writeTime;
        log             true;
        valueFormat     ascii;
        
        source          patch;
        sourceName      outlet; // 본인의 outlet 패치 이름 확인
        
        operation       sum;
        fields
        (
            phi
        );
        
        // 물(alpha.water) 분율을 곱해서 '물'의 유량만 추출
        // OpenFOAM 런타임에서 필드 가중치 처리가 안 될 경우, 
        // 나중에 postProcess -func "weightedSum(phi, alpha.water)" 형태로 보완 가능합니다.
        // 우선은 phi(전체 질량)라도 정확히 뽑히는지 보겠습니다.
    }
}

// ************************************************************************* //